In [45]:
import pandas as pd
df=pd.read_csv("C:\\Users\\Acer\\OneDrive\\Desktop\\CSV files\\titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [46]:
df.drop(['Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   PassengerId  Pclass     Sex   Age     Fare  Survived
0            1       3    male  22.0   7.2500         0
1            2       1  female  38.0  71.2833         1
2            3       3  female  26.0   7.9250         1
3            4       1  female  35.0  53.1000         1
4            5       3    male  35.0   8.0500         0

In [47]:
inputs = df.drop('Survived',axis='columns')
target = df.Survived

In [48]:
inputs.head()

   PassengerId  Pclass     Sex   Age     Fare
0            1       3    male  22.0   7.2500
1            2       1  female  38.0  71.2833
2            3       3  female  26.0   7.9250
3            4       1  female  35.0  53.1000
4            5       3    male  35.0   8.0500

In [49]:
target.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [50]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [51]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   PassengerId  Pclass     Sex   Age     Fare  female  male
0            1       3    male  22.0   7.2500       0     1
1            2       1  female  38.0  71.2833       1     0
2            3       3  female  26.0   7.9250       1     0

In [52]:
inputs.drop(['Sex','male'],axis='columns',inplace=True)
inputs.head(3)

   PassengerId  Pclass   Age     Fare  female
0            1       3  22.0   7.2500       0
1            2       1  38.0  71.2833       1
2            3       3  26.0   7.9250       1

In [53]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [54]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [55]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(10)

   PassengerId  Pclass        Age     Fare  female
0            1       3  22.000000   7.2500       0
1            2       1  38.000000  71.2833       1
2            3       3  26.000000   7.9250       1
3            4       1  35.000000  53.1000       1
4            5       3  35.000000   8.0500       0
5            6       3  29.699118   8.4583       0
6            7       1  54.000000  51.8625       0
7            8       3   2.000000  21.0750       0
8            9       3  27.000000  11.1333       1
9           10       2  14.000000  30.0708       1

In [71]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.1)

In [72]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [73]:
model.fit(X_train,y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [74]:
model.score(X_test,y_test)

0.8222222222222222

In [75]:
len(X_train)

801

In [76]:
len(X_test)

90

In [77]:
X_test[0:10]

     PassengerId  Pclass        Age      Fare  female
817          818       2  31.000000   37.0042       0
672          673       2  70.000000   10.5000       0
650          651       3  29.699118    7.8958       0
167          168       3  45.000000   27.9000       1
178          179       2  30.000000   13.0000       0
374          375       3   3.000000   21.0750       1
227          228       3  20.500000    7.2500       0
87            88       3  29.699118    8.0500       0
814          815       3  30.500000    8.0500       0
659          660       1  58.000000  113.2750       0

In [82]:
y_test[0:20]

817    0
672    0
650    0
167    0
178    0
374    0
227    0
87     0
814    0
659    0
496    1
150    0
377    0
211    1
738    0
836    0
359    1
796    1
720    1
490    0
Name: Survived, dtype: int64

In [84]:
model.predict(X_test[0:20])

array([0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 1, 0, 1, 1, 0, 0, 1, 1, 1, 0],
      dtype=int64)

In [85]:
model.predict_proba(X_test[:20])

array([[9.15473222e-01, 8.45267776e-02],
       [8.57891186e-01, 1.42108814e-01],
       [9.64823637e-01, 3.51763631e-02],
       [4.45897882e-01, 5.54102118e-01],
       [9.25780617e-01, 7.42193831e-02],
       [2.85559101e-01, 7.14440899e-01],
       [9.58830258e-01, 4.11697424e-02],
       [9.65377616e-01, 3.46223835e-02],
       [9.66600994e-01, 3.33990064e-02],
       [4.24123770e-02, 9.57587623e-01],
       [1.59527126e-02, 9.84047287e-01],
       [9.18274819e-01, 8.17251815e-02],
       [2.84323946e-07, 9.99999716e-01],
       [2.82768139e-01, 7.17231861e-01],
       [9.65550035e-01, 3.44499655e-02],
       [9.62089640e-01, 3.79103604e-02],
       [4.55628147e-01, 5.44371853e-01],
       [8.88873552e-02, 9.11112645e-01],
       [1.58660140e-01, 8.41339860e-01],
       [9.64431878e-01, 3.55681215e-02]])

In [86]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),X_train, y_train, cv=5)

array([0.7826087, 0.75     , 0.7875   , 0.7375   , 0.75     ])

In [87]:
df.to_csv('titanic_data.csv',columns=['PassengerId','Survived'],index=False)